<?php
header("content-type:text/html;charset=utf-8");
// 浮点数进行比较大小的说明(指含有运算的)
$f1 = 8.4 / 3;
if ($f1 == 2.8) {
    echo '<br>$f1 == 2.8';
} else {
    echo '<br>$f1 != 2.8';
}

$f2 = 9.3 / 3;
if ($f2 == 3.1) {
    echo '<br>$f2 == 3.1';
} else {
    echo '<br>$f2 != 3.1';
}

// 不要轻易比较两个浮点数的大小(尤其是在有运算的时候)
//1.方案  使用round将浮点数转换成一个整数,再比较
if (round($f1 * 10000) == round(2.8 * 10000)) {
    echo '<br>round($f1*10000) == round($f2*10000)';
}
//2.方案 使用相差值的绝对值,和一个极小值进行比较
$min_val = 0.00000000000001;
if (abs($f1 - 2.8) < $min_val) {
    echo '<br>abs($f1-2.8) < $min_val';
}

//3.浮点数比较大小方法说明补充(如果两个浮点数,是直接赋值给的浮点数,不含运算,是可以进行比较大小的)
$f3 = 2.8;
if ($f3 == 2.8) {
    echo '<br> $f3 == 2.8';
}
