<?php
header("content-type:text/html;charset=utf-8");
// 小数的使用说明
$salary = 1345.69;
echo '<pre>';
var_dump($salary);

/*
细节
1.浮点数(也叫双精度数或实数)
2.浮点数的字长和平台相关,通常最大值是1.8e308, 并具有14位十进制数字的精度(这个限制很重要)
14位精度值,是从左边的第一个非0数字开始计算; 当到达最后这个数,会使用四舍五入
 */
$num = 0.12345678910111213; //float 0.12345678910111
$num = 0.12345678910111513; //float 0.12345678910112
$num = 0.12345678910222; //float 0.12345678910222
var_dump($num);

//浮点数的范围到底有多大?
$num2 = 123456789012345678901234567890;
var_dump($num2); //float 1.2345678901235E+29

